; domain
(define (domain ulzhal)
  (:requirements :typing :equality)
  (:types thing - thing
   location - location
   direction - direction
)
  (:predicates 
	(move-dir ?v0 - location ?v1 - location ?v2 - direction)
	(is-nongoal ?v0 - location)
	(clear ?v0 - location)
	(is-block ?v0 - thing)
	(at ?v0 - thing ?v1 - location)
	(is-agent ?v0 - thing)
	(at-goal ?v0 - thing)
	(is-goal ?v0 - location)
  )
  

	(:action move
		:parameters (?p - thing ?from - location ?to - location ?dir - direction)
		:precondition (and 
			(is-agent ?p)
			(at ?p ?from)
			(clear ?to)
			(move-dir ?from ?to ?dir))
		:effect (and
			(not (at ?p ?from))
			(not (clear ?to))
			(at ?p ?to)
			(clear ?from))
	)
	

	(:action push-to-goal
		:parameters (?p - thing ?s - thing ?ppos - location ?from - location ?to - location ?dir - direction)
		:precondition (and 
			(is-agent ?p)
			(is-block ?s)
			(at ?p ?ppos)
			(at ?s ?from)
			(clear ?to)
			(move-dir ?ppos ?from ?dir)
			(move-dir ?from ?to ?dir)
			(is-goal ?to))
		:effect (and
			(not (at ?p ?ppos))
			(not (at ?s ?from))
			(not (clear ?to))
			(at ?p ?from)
			(at ?s ?to)
			(clear ?ppos)
			(at-goal ?s))
	)
	

	(:action push-to-nongoal
		:parameters (?p - thing ?s - thing ?ppos - location ?from - location ?to - location ?dir - direction)
		:precondition (and 
			(is-agent ?p)
			(is-block ?s)
			(at ?p ?ppos)
			(at ?s ?from)
			(clear ?to)
			(move-dir ?ppos ?from ?dir)
			(move-dir ?from ?to ?dir)
			(is-nongoal ?to))
		:effect (and
			(not (at ?p ?ppos))
			(not (at ?s ?from))
			(not (clear ?to))
			(at ?p ?from)
			(at ?s ?to)
			(clear ?ppos)
			(not (at-goal ?s)))
	)

)

; problem
(define (problem p01) 
  (:domain ulzhal)
  (:objects
        down - direction
    	left - direction
    	right - direction
    	up - direction
    	robot - thing
    	pos-1-1 - location
    	pos-1-2 - location
    	pos-1-3 - location
    	pos-2-1 - location
    	pos-2-2 - location
    	pos-2-3 - location
    	pos-3-1 - location
    	pos-3-2 - location
    	pos-3-3 - location
    	pos-4-1 - location
    	pos-4-2 - location
    	pos-4-3 - location
    	block-01 - thing
    	
  )
  (:init 
	(at robot pos-1-2)
	(at block-01 pos-3-2)
    	(clear pos-1-1)
	(clear pos-1-3)
	(clear pos-2-1)
	(clear pos-3-1)
	(clear pos-2-2)
	(clear pos-2-3)
	(clear pos-3-3)
	(is-goal pos-3-3)
	(is-nongoal pos-1-1)
	(is-nongoal pos-1-2)
	(is-nongoal pos-2-1)
	(is-nongoal pos-2-2)
	(is-nongoal pos-2-3)
	(is-nongoal pos-3-1)
	(is-nongoal pos-3-2)
	(is-nongoal pos-3-3)
	(is-agent robot)
	(is-block block-01)
	
    	(move-dir pos-1-1 pos-1-2 down)
    	(move-dir pos-1-1 pos-2-1 right)
    	(move-dir pos-1-2 pos-2-2 right)
	(move-dir pos-1-2 pos-1-3 down)
	(move-dir pos-1-2 pos-1-1 up)
	(move-dir pos-1-3 pos-1-2 up)
	(move-dir pos-1-3 pos-2-3 right)
	(move-dir pos-2-1 pos-1-1 left)
	(move-dir pos-2-1 pos-3-1 right)
	(move-dir pos-2-1 pos-2-2 down)
	(move-dir pos-2-2 pos-3-2 right)
	(move-dir pos-2-2 pos-2-1 up)
	(move-dir pos-2-3 pos-2-2 up)
	(move-dir pos-2-3 pos-3-3 right)
	(move-dir pos-2-3 pos-1-3 left)
	(move-dir pos-2-2 pos-1-2 left)	
	(move-dir pos-2-2 pos-2-3 down)
	(move-dir pos-3-1 pos-2-1 left)
	(move-dir pos-3-1 pos-3-2 down)
	(move-dir pos-3-2 pos-2-2 left)
	(move-dir pos-3-2 pos-3-3 down)
	(move-dir pos-3-2 pos-3-1 up)
	(move-dir pos-3-3 pos-2-3 left)
	(move-dir pos-3-3 pos-3-2 up)
	
)
(:goal (and
	(at-goal block-01)))

)

; plan
1. (move robot pos-1-2 pos-2-2 right)
   deleted: (at robot pos-1-2) (clear pos-2-2)
   added: (at robot pos-2-2) (clear pos-1-2)
   goals met: 0 of 1
2. (move robot pos-2-2 pos-2-1 up)
   deleted: (at robot pos-2-2) (clear pos-2-1)
   added: (at robot pos-2-1) (clear pos-2-2)
   goals met: 0 of 1
3. (move robot pos-2-1 pos-3-1 right)
   deleted: (at robot pos-2-1) (clear pos-3-1)
   added: (at robot pos-3-1) (clear pos-2-1)
   goals met: 0 of 1
4. (push-to-goal robot block-01 pos-3-1 pos-3-2 pos-3-3 down)
   deleted: (at robot pos-3-1) (at block-01 pos-3-2) (clear pos-3-3)
   added: (at robot pos-3-2) (at block-01 pos-3-3) (clear pos-3-1) (at-goal block-01)
   goals met: 1 of 1
